[[file:source/user/template.el::;;; user/config/TODO-FILENAME.el --- TODO-SHORT-DESCRIPTION -*- lexical-binding: t; -*-][template.el]]
GOTO [[here][U R HERE]]

* ├DONE───┤ org eval src blocks: shells
CLOSED: [2025-10-08 Wed 21:57]
:LOGBOOK:
- State "├DONE───┤"  from "├CURRENT┤"  [2025-10-08 Wed 21:57]
- State "├CURRENT┤"  from              [2025-10-08 Wed 21:50]
:END:

Want to be able to eval bash...

InternGPT says:
#+begin_quote
To enable evaluating source blocks for Bash in Emacs Lisp when using Org-mode,
you need to ensure that the =ob-shell= package is loaded or required, and the
language is included in the list of supported languages for evaluation. You can
achieve this by adding the following code to your Emacs configuration:

#+begin_src lisp
(org-babel-do-load-languages
 'org-babel-load-languages
 '((shell . t))) ; Enable evaluation for shell scripts (including bash)
#+end_src

Make sure Org-mode is installed and configured in your Emacs setup. After adding
this code, you can evaluate shell source blocks within Org-mode documents. Note
that it's important to be cautious and understand the security implications of
executing code blocks.
#+end_quote

#+begin_src bash
ls
#+end_src

#+RESULTS:
| 42.org         |
| auto-save-list |
| early-init.el  |
| eln-cache      |
| elpa           |
| etc            |
| init.el        |
| LICENSE        |
| scripts        |
| snippets       |
| source         |
| symlink.sh     |
| var            |

yay

** ├DONE───┤ use-package parser
CLOSED: [2025-10-16 Thu 16:37]
:PROPERTIES:
:ORDERED:  t
:END:
:LOGBOOK:
- State "├DONE───┤"  from "├CURRENT┤"  [2025-10-16 Thu 16:37]
- State "├CURRENT┤"  from              [2025-09-25 Thu 15:44]
:END:

Make load parse its args like use-package does?
  - ur [[file:source/core/packages/imp/parser.el::provide 'use-package-core][here]]
    - Refactor that to be useful to imp.

Mmh...
(setq imp-parser-verbose 'debug)
then see how it goes?


(setq imp-parser-verbose nil)
(setq imp-parser-verbose 'errors)
(setq imp-parser-verbose 'debug)
(imp-parser foo)
(imp-parser foo :optional t)
(imp-parser foo :optional t :error t)

(imp-parser foo :path (imp-path-current-dir))

And then:
  - [X] make defaults [[file:source/core/packages/imp/parser.el::(defcustom imp-parser-defaults][here]]
  - [ ] Make bare minimum work:
    - (imp-parser foo)
      - load from PWD or load-paths?
    - (imp-parser :user test)
      - load test from :user root?
      - Should I change to something like (imp-parser user/test)?

So... I need the handlers to call the load func once they're all done?
So... ~imp-parser-process-keywords~ needs the logic.
  - [[file:source/core/packages/imp/parser.el::;; TODO: (if (null plist)][imp-parser-process-keywords]]
  - [[file:source/core/packages/imp/parser.el::defun imp-parser-load (name state][imp-parser-load]]

(setq imp-parser-verbose nil)
(setq imp-parser-verbose 'debug)
(imp-parser foo)
(imp-parser foo :optional t)
(imp-parser foo :optional t :error t)

Make path normalizer more dumb?
  - Make the defaults an ordered list?
  - Make people use ":/" or ~FOO:/blah~ or ~(from-)feature(-root)~ for feature-rooted paths?
  - Make people use "./" or ~pwd~ for ~imp-path-current-dir~?
  - Maybe get it down to the only guess being ~user-emacs-directory~?

Check path normalizer/handler.

(imp-parser-normalize/:path :user/foo :path '(nil))
(imp-parser-normalize/:path :user/foo :path '(root))
(imp-parser-normalize/:path :user/foo :path '(.emacs.d))
(imp-parser-normalize/:path :user/foo :path '(cwd))

k

maybe I should try an actually bound symbol?
(imp-parser-normalize-path :user :path 'user-emacs-directory)
(imp-parser-normalize/:path :user/foo :path '(user-emacs-directory))
Yay. It follows its symlink.

Make file that can be loaded many times.
  - w/ just a message or something in it.
file:/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test.el


Refactor ~imp/feature.el~ for new style features.
  - [[file:source/core/packages/imp/feature.el][here]]
look for ~TODO-HERE~
  - [X] k

#+begin_src elisp
;; TODO-HERE: Which is a rooted feature?
;; :root/first/second
;; root:/first/second
#+end_src
  - [[file:source/core/packages/imp/feature.el::;; TODO-HERE: Which is a rooted feature?][here]]
  - [X] k

Honestly I should be on an imp branch...
  - [X] k

ok
I think I have all the `imp-feature` things I need now.

Fix default path w/ feature root:
#+begin_src elisp
(imp-parser imp:/test/data/load/manual-test)
(imp-parser '(imp test data/load manual-test))
#+end_src

#+begin_src backtrace
Debugger entered--Lisp error: (wrong-type-argument stringp nil)
  file-name-nondirectory(nil)
  imp--path-filename(nil)
  (let ((imp--macro-filename (imp--path-filename path)) (imp--macro-path (imp-path-parent path)) (imp--macro-time (current-time))) (setq imp--timing-feature-current imp--macro-feature) (imp--timing-start imp--macro-feature imp--macro-filename imp--macro-path) (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) (load path (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time)))
  (if (and (imp-timing-enabled?) (not (imp--timing-feature-duplicate? imp--macro-feature))) (let ((imp--macro-filename (imp--path-filename path)) (imp--macro-path (imp-path-parent path)) (imp--macro-time (current-time))) (setq imp--timing-feature-current imp--macro-feature) (imp--timing-start imp--macro-feature imp--macro-filename imp--macro-path) (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) (load path (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))) (load path (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage))
  (let ((imp--macro-feature (imp--feature-normalize-to-list name))) (if (and (imp-timing-enabled?) (not (imp--timing-feature-duplicate? imp--macro-feature))) (let ((imp--macro-filename (imp--path-filename path)) (imp--macro-path (imp-path-parent path)) (imp--macro-time (current-time))) (setq imp--timing-feature-current imp--macro-feature) (imp--timing-start imp--macro-feature imp--macro-filename imp--macro-path) (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) (load path (not (or ... ...)) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))) (load path (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage)))
  (let* ((funcname "imp-parser-load") (path (plist-get state :path))) (if imp--debugging? (progn (imp--debug funcname "load '%s'" path-load))) (let ((imp--macro-feature (imp--feature-normalize-to-list name))) (if (and (imp-timing-enabled?) (not (imp--timing-feature-duplicate? imp--macro-feature))) (let ((imp--macro-filename (imp--path-filename path)) (imp--macro-path (imp-path-parent path)) (imp--macro-time (current-time))) (setq imp--timing-feature-current imp--macro-feature) (imp--timing-start imp--macro-feature imp--macro-filename imp--macro-path) (prog1 (let ((imp--timing-indent ...)) (load path (not ...) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))) (load path (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage))))
  imp-parser-load(imp:/test/data/load/manual-test nil)
...
#+end_src

Hmmm... I need a normalizer and handler for NAME/FEATURE in imp-parser.

#+begin_src elisp
(imp-parser imp:/test/data/load/manual-test)
(imp-parser (imp test data/load manual-test))
#+end_src

#+begin_src backtrace
Debugger entered--Lisp error: (wrong-type-argument listp t)
  cdr(t)
  macroexp-progn(t)
  (pp-to-string (macroexp-progn (let ((imp-parser-verbose 'errors) (imp-parser-expand-minimally t)) (imp-parser-process-keywords name* args*))))
  (concat "\n\n" (pp-to-string (cons 'imp-parser (cons 'name* args))) "\n  -->\n\n" (pp-to-string (cons 'imp-parser (cons 'name* args*))) "\n  ==>\n\n" (pp-to-string (macroexp-progn (let ((imp-parser-verbose 'errors) (imp-parser-expand-minimally t)) (imp-parser-process-keywords name* args*)))))
...
#+end_src

Now I need to return a form so the macro works.

and then?
#+begin_src elisp
(imp-parser imp:/test/data/load/manual-test)
#+end_src

...imp-timing macro is sad.
make one that returns forms instead of evals them?
or do I have one?

How do I debug the macro expansion anyways?
  - ~macrostep~ doesn't work.

How 'bout this?
#+begin_src elisp
(imp-parser-debug imp:/test/data/load/manual-test nil)
#+end_src

#+RESULTS:
: ((imp-timing 'imp:/test/data/load/manual-test "manual-test"
:              "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load"
:    (load
:     "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:     (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage)))

need to eval all the state gets.
  - k

#+begin_src elisp
(imp-parser-debug imp:/test/data/load/manual-test nil)
#+end_src

#+RESULTS:
: ((imp-timing 'imp:/test/data/load/manual-test "manual-test"
:              "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load"
:    (load
:     "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:     (not (or nil nil)) 'nomessage)))

...imp-timing macro is probably still sad.
make one that returns forms instead of evals them
  - ~imp-timing-core~?
    - [[file:source/core/packages/imp/timing.el::defmacro imp-timing-core (feature filename path &rest body][yeah]]
Make that thing work.
And only take a path.
[[file:source/core/packages/imp/timing.el::defmacro imp-timing-core (feature filename path &rest body][yeah]] go here.

#+begin_src elisp
(imp-timing-core 'imp:/test/data/load/manual-test/1
    "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
    (message "Hello there."))
#+end_src

that might work maybe?

#+begin_src elisp
(imp-parser-debug imp:/test/data/load/manual-test nil)
#+end_src

#+RESULTS:
: ((imp-timing-core 'imp:/test/data/load/manual-test
:      "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:      (load
:       "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:       (not (or nil nil)) 'nomessage)))

Maybe. Try it.

#+begin_src elisp
(imp-parser imp:/test/data/load/manual-test)
#+end_src

#+begin_src backtrace
Debugger entered--Lisp error: (invalid-function (let ((imp--macro-time (current-time))) (setq imp--timing-feature-current 'quote/name) (imp--timing-start 'quote/name "name") (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) (load "name" (not (or nil nil)) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))))
  ((let ((imp--macro-time (current-time))) (setq imp--timing-feature-current 'quote/name) (imp--timing-start 'quote/name "name") (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) (load "name" (not (or nil nil)) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))))
  (progn ((let ((imp--macro-time (current-time))) (setq imp--timing-feature-current 'quote/name) (imp--timing-start 'quote/name "name") (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) (load "name" (not (or nil nil)) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time)))))
  eval((progn ((let ((imp--macro-time (current-time))) (setq imp--timing-feature-current 'quote/name) (imp--timing-start 'quote/name "name") (prog1 (let ((imp--timing-indent ...)) (load "name" (not ...) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))))) t)
  elisp--eval-last-sexp(nil)
  #f(compiled-function () #<bytecode 0x480b065b629a>)()
  handler-bind-1(#f(compiled-function () #<bytecode 0x480b065b629a>) (error) eval-expression--debug)
  eval-last-sexp(nil)
  funcall-interactively(eval-last-sexp nil)
  call-interactively(eval-last-sexp nil nil)
  command-execute(eval-last-sexp)
#+end_src


#+begin_src elisp
(pp-to-string (imp-parser-load 'imp:/test/data/load/manual-test nil))
#+end_src

#+RESULTS:
#+begin_example elisp
((let ((imp--macro-time (current-time)))
   (setq imp--timing-feature-current 'imp:/test/data/load/manual-test)
   (imp--timing-start 'imp:/test/data/load/manual-test
                      "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test")
   (prog1
       (let ((imp--timing-indent (1+ imp--timing-indent)))
         (load
          "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
          (not (or nil nil)) 'nomessage))
     (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))))
#+end_example

That looks right, right?


#+begin_src elisp
(imp-parser-debug imp:/test/data/load/manual-test nil)
#+end_src

#+RESULTS:
#+begin_example elisp
((let ((imp--macro-time (current-time)))
   (setq imp--timing-feature-current 'imp:/test/data/load/manual-test)
   (imp--timing-start 'imp:/test/data/load/manual-test
                      "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test")
   (prog1
       (let ((imp--timing-indent (1+ imp--timing-indent)))
         (load
          "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
          (not (or nil nil)) 'nomessage))
     (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))))
#+end_example

Also looks right, right?

#+begin_src elisp
(macroexpand (imp-parser imp:/test/data/load/manual-test))
#+end_src

Annd... I got:
#+begin_quote
loading name...
└─00.0057 seconds
#+end_quote

#+begin_src elisp
(imp-parser-handler/:requires 'foo :requires '(bar) nil nil)
#+end_src
hm....

#+begin_src elisp
(macroexpand (imp-parser imp:/test/data/load/manual-test))
#+end_src

#+begin_src elisp
(pp-to-string (imp-timing-core imp:/test/data/load/manual-test/1
    "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
    (message "Hello there.")))
#+end_src
better maybe?

#+begin_src elisp
(imp-parser imp:/test/data/load/manual-test)
#+end_src

#+begin_src backtrace
Debugger entered--Lisp error: (void-variable let)
  (progn let ((imp--macro-time (current-time))) (setq imp--timing-feature-current 'feature) (imp--timing-start 'feature "feature") (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) (load "feature" (not (or nil nil)) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time)))
  (progn (progn let ((imp--macro-time (current-time))) (setq imp--timing-feature-current 'feature) (imp--timing-start 'feature "feature") (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) (load "feature" (not (or nil nil)) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))))
  eval((progn (progn let ((imp--macro-time (current-time))) (setq imp--timing-feature-current 'feature) (imp--timing-start 'feature "feature") (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) (load "feature" (not (or nil nil)) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time)))) t)
  elisp--eval-last-sexp(nil)
  #f(compiled-function () #<bytecode 0x480b065b629a>)()
  handler-bind-1(#f(compiled-function () #<bytecode 0x480b065b629a>) (error) eval-expression--debug)
  eval-last-sexp(nil)
  funcall-interactively(eval-last-sexp nil)
  call-interactively(eval-last-sexp nil nil)
  command-execute(eval-last-sexp)
#+end_src

nope.

SIIIIIGH
I wish I knew how to expand macros one step at a time....

#+begin_src elisp
(pp-to-string
 (macroexp-progn
  (imp-parser-concat
   (imp-parser-core imp:/test/data/load/manual-test nil))))
#+end_src

#+RESULTS:
#+begin_example elisp
(let ((imp--macro-time (current-time)))
  (setq imp--timing-feature-current 'imp:/test/data/load/manual-test)
  (imp--timing-start 'imp:/test/data/load/manual-test
                     "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test")
  (prog1
      (let ((imp--timing-indent (1+ imp--timing-indent)))
        (load
         "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
         (not (or nil nil)) 'nomessage))
    (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time)))
#+end_example

Hmm.... ~load.el~ won't load right now.
#+begin_src elisp
(load (expand-file-name "source/core/packages/imp/load.el" user-emacs-directory))
#+end_src

That fails because of ~imp--load-paths~
~imp--load-paths~ because of ~imp-timing~
~imp-timing~ still had a ~filename~ var; deleted.

#+begin_src elisp
(load (expand-file-name "source/core/packages/imp/load.el" user-emacs-directory))
#+end_src
yay

so imp-parser-core works
Why doesn't imp-parser work? :(
I broke use-package's parser :((

restart & reload...
  - that always fixes things. :fingers-crossed:

#+begin_src elisp
(imp-parser imp:/test/data/load/manual-test)
#+end_src

ok. This is better than last night.
#+begin_src backtrace
Debugger entered--Lisp error: (void-variable state)
  (plist-get state :error)
  (or (plist-get state :error) (plist-get state :optional))
  (not (or (plist-get state :error) (plist-get state :optional)))
  (load "imp/test/data/load/manual-test" (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage)
  (let ((imp--timing-indent (1+ imp--timing-indent))) "imp/test/data/load" (load "imp/test/data/load/manual-test" (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage))
  (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) "imp/test/data/load" (load "imp/test/data/load/manual-test" (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))
  (let ((imp--macro-path "manual-test") (imp--macro-time (current-time))) (setq imp--timing-feature-current imp--macro-feature) (imp--timing-start imp--macro-feature imp--macro-path) (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) "imp/test/data/load" (load "imp/test/data/load/manual-test" (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time)))
  (if (and (imp-timing-enabled?) (not (imp--timing-feature-duplicate? imp--macro-feature))) (let ((imp--macro-path "manual-test") (imp--macro-time (current-time))) (setq imp--timing-feature-current imp--macro-feature) (imp--timing-start imp--macro-feature imp--macro-path) (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) "imp/test/data/load" (load "imp/test/data/load/manual-test" (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))) "imp/test/data/load" (load "imp/test/data/load/manual-test" (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage))
  (let ((imp--macro-feature (imp--feature-normalize-chain 'imp/test/data/load/manual-test))) (if (and (imp-timing-enabled?) (not (imp--timing-feature-duplicate? imp--macro-feature))) (let ((imp--macro-path "manual-test") (imp--macro-time (current-time))) (setq imp--timing-feature-current imp--macro-feature) (imp--timing-start imp--macro-feature imp--macro-path) (prog1 (let ((imp--timing-indent (1+ imp--timing-indent))) "imp/test/data/load" (load "imp/test/data/load/manual-test" (not (or ... ...)) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))) "imp/test/data/load" (load "imp/test/data/load/manual-test" (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage)))
  (progn (let ((imp--macro-feature (imp--feature-normalize-chain 'imp/test/data/load/manual-test))) (if (and (imp-timing-enabled?) (not (imp--timing-feature-duplicate? imp--macro-feature))) (let ((imp--macro-path "manual-test") (imp--macro-time (current-time))) (setq imp--timing-feature-current imp--macro-feature) (imp--timing-start imp--macro-feature imp--macro-path) (prog1 (let ((imp--timing-indent ...)) "imp/test/data/load" (load "imp/test/data/load/manual-test" (not ...) 'nomessage)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))) "imp/test/data/load" (load "imp/test/data/load/manual-test" (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage))))
  eval((progn (let ((imp--macro-feature (imp--feature-normalize-chain 'imp/test/data/load/manual-test))) (if (and (imp-timing-enabled?) (not (imp--timing-feature-duplicate? imp--macro-feature))) (let ((imp--macro-path "manual-test") (imp--macro-time (current-time))) (setq imp--timing-feature-current imp--macro-feature) (imp--timing-start imp--macro-feature imp--macro-path) (prog1 (let (...) "imp/test/data/load" (load "imp/test/data/load/manual-test" ... ...)) (setq imp--timing-feature-current nil) (imp--timing-end imp--macro-time))) "imp/test/data/load" (load "imp/test/data/load/manual-test" (not (or (plist-get state :error) (plist-get state :optional))) 'nomessage)))) t)
  elisp--eval-last-sexp(nil)
  #f(compiled-function () #<bytecode 0xa2a0a50c829a>)()
  handler-bind-1(#f(compiled-function () #<bytecode 0xa2a0a50c829a>) (error) eval-expression--debug)
  eval-last-sexp(nil)
  funcall-interactively(eval-last-sexp nil)
  call-interactively(eval-last-sexp nil nil)
  command-execute(eval-last-sexp)
#+end_src

Oh. It works-ish?
#+begin_src elisp
(imp-parser imp:/test/data/load/manual-test)
#+end_src
Didn't get any timing this time, but:

#+begin_quote
Loading ’manual-test.el’ for 0 time...
t
#+end_quote
I loaded it for the first time.
  - yay.
I got back a ~t~ return value.
  - yay.

With timing this time tho?

Oh; this is how macroexpand works. You gotta quote it.
#+begin_src elisp :results scalar
(macroexpand-1 '(imp-parser imp:/test/data/load/manual-test))
#+end_src

#+RESULTS:
: (imp-timing 'imp:/test/data/load/manual-test "manual-test" "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load" (load "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test" (not (or nil nil)) 'nomessage))

Oh. this still has filename & dir path.
Need just filepath.
#+begin_src elisp
(imp-timing 'imp:/test/data/load/manual-test
    "manual-test"
    "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load"
(load "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test" (not (or nil nil)) 'nomessage))
#+end_src

#+begin_src elisp :results scalar
(macroexpand-1 '(imp-parser imp:/test/data/load/manual-test))
#+end_src

#+RESULTS:
: (imp-timing 'imp:/test/data/load/manual-test "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test" (load "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test" (not (or nil nil)) 'nomessage))

Oh. I'm not using ~imp-timing-core~.
:thinking:
If it works, use it?

#+begin_src elisp
(macroexpand-1
 (imp-timing 'imp:/test/data/load/manual-test
     "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
     (load "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
           (not (or nil nil))
           'nomessage)))
#+end_src

#+RESULTS:
: t

Aw... Still no timing message.
Is timing enabled?
oh; clear current feature.
#+begin_src
imp--timing-feature-current
(setq imp--timing-feature-current nil)
#+end_src

#+begin_src elisp
(imp-timing 'imp:/test/data/load/manual-test
     "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
     (load "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
           (not (or nil nil))
           'nomessage))
#+end_src

#+RESULTS:
: t

yay. got timing message.
#+begin_quote
loading imp:/test/data/load/manual-test...
└─00.0075 seconds
#+end_quote

And then....?
  - [X] commit
  - [ ] test with args

I think that counts as
  - [X] Make bare minimum work

and this headline is long
TO THE NEXT HEADLINE!

** ├DONE───┤ imp-parser keywords: ~optional~, ~error~
CLOSED: [2025-10-16 Thu 17:21]
:LOGBOOK:
- State "├DONE───┤"  from "├CURRENT┤"  [2025-10-16 Thu 17:21]
- State "├CURRENT┤"  from              [2025-10-16 Thu 16:41]
:END:

#+begin_src elisp
(setq imp--timing-feature-current nil)
(pp-to-string (macroexpand-1 '(imp-parser imp:/test/data/load/manual-test :optional t :error t)))
#+end_src

#+RESULTS:
: (imp-timing 'imp:/test/data/load/manual-test
:     "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:     (load
:      "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:      (not (or :error :optional)) 'nomessage))

Ok, so the args show up in the macro output.

optional file that DNE:
#+begin_src elisp
(setq imp--timing-feature-current nil)
(pp-to-string (macroexpand-1 '(imp-parser imp:/test/data/load/manual-test :optional t :error nil)))
#+end_src

#+RESULTS:
: (imp-timing 'imp:/test/data/load/manual-test
:     "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:     (load
:      "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:      'noerror 'nomessage))

Add defaults for:
  -  ~:error~; should be true.
  -  ~:optional~; should be false.

and this should have a nil for ~noerror~ param
#+begin_src elisp
(setq imp--timing-feature-current nil)
(pp-to-string (macroexpand-1 '(imp-parser imp:/test/data/load/manual-test)))
#+end_src

#+RESULTS:
: (imp-timing 'imp:/test/data/load/manual-test
:     "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:     (load
:      "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:      nil 'nomessage))

yay

so this should error
#+begin_src elisp
(setq imp--timing-feature-current nil)
(imp-parser imp:/test/data/load/does-not-exist)
#+end_src

it did.

and this should not error
#+begin_src elisp
(setq imp--timing-feature-current nil)
(imp-parser imp:/test/data/load/does-not-exist :optional t)
#+end_src

#+RESULTS:

it did not error.
  - yay

also this should not error
#+begin_src elisp
(setq imp--timing-feature-current nil)
(imp-parser imp:/test/data/load/does-not-exist :error nil)
#+end_src

#+RESULTS:

it did not error.
  - yay

However, imp-timing doesn't know about whether optionals exist or not.

** ├DONE───┤ more info about optional files
CLOSED: [2025-10-16 Thu 20:29]
:LOGBOOK:
- State "├DONE───┤"  from "├CURRENT┤"  [2025-10-16 Thu 20:29]
- State "├CURRENT┤"  from              [2025-10-16 Thu 17:23]
:END:

We should get "optional file dne; skipping" info in the imp-timing buffer for this:
#+begin_src elisp
(setq imp--timing-feature-current nil)
(imp-parser imp:/test/data/load/does-not-exist :optional t)
#+end_src

~imp-load~ does it like so:
#+begin_src elisp
;;---
;; Optional?
;;---
;; Skip if optional and file doesn't exist.
((and imp--macro-optional?
      (not (file-exists-p imp--macro-path-file)))
 ;; Skip w/ optional timing message.
 (imp-timing-skip-optional-dne imp--macro-feature
                               imp--macro-name-load
                               imp--macro-path-file)
 (setq imp--macro-load-file? nil)
 ;; Return nil for 'did not load'.
 (setq imp--macro-load-result nil))
#+end_src
  - [[file:source/core/packages/imp/load.el::;; Optional?][here]]

make imp-path-has-load-extension work
  - k

fix imp-path-load-file to work if path already has ext
  - k

#+begin_src elisp
(imp-path-load-file "~/.config/emacs/source/core/packages/imp/test/data/load/manual-test")
(imp-path-load-file "~/.config/emacs/source/core/packages/imp/test/data/load/manual-test.el")
(imp-path-has-load-extension "~/.config/emacs/source/core/packages/imp/test/data/load/manual-test")
(imp-path-has-load-extension "~/.config/emacs/source/core/packages/imp/test/data/load/manual-test.el")
#+end_src

hokay...
use those somewhere...
~imp-parser-load~

#+begin_src elisp
(setq imp--timing-feature-current nil)
(pp-to-string (macroexpand-1 '(imp-parser imp:/test/data/load/does-not-exist :optional t)))
#+end_src

#+RESULTS:
: (progn
:   (imp-timing-skip-optional-dne 'imp:/test/data/load/does-not-exist
:                                 "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/does-not-exist")
:   nil)


#+begin_src elisp
(setq imp--timing-feature-current nil)
(imp-parser imp:/test/data/load/does-not-exist :optional t)
#+end_src

#+begin_quote
skip: imp:/test/data/load/does-not-exist
│ └─reason: optional file does not exist: /home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/does-not-exist
#+end_quote

** ├DONE───┤ imp-parser keyword: ~:path~
CLOSED: [2025-10-16 Thu 21:27]
:LOGBOOK:
- State "├DONE───┤"  from              [2025-10-16 Thu 21:27]
:END:

So this works.
#+begin_src elisp
(setq imp--timing-feature-current nil)
(imp-parser imp:/test/data/load/does-not-exist)
#+end_src

Will this work?
Can't remember if it assumes ~user-emacs-directory~ if it has nothing.
#+begin_src elisp
(setq imp--timing-feature-current nil)
(imp-parser source/core/packages/imp/test/data/load/manual-test)
#+end_src

Nope. It has no path so it assumes nothing.
#+begin_quote
Debugger entered--Lisp error: (error "[ERROR--]: imp-parser-load:
Cannot find a file to load.
path:’source/core/packages/imp/test/data/load/manual-test’ -> load-path:’nil’")
#+end_quote

er... now the warnings buffer says
#+begin_quote
⛔ Error (imp-parser): Failed to parse package source/core/packages/imp/test/data/load/manual-test: Wrong type argument: stringp, nil
#+end_quote

Oh. That's the condition case that catches the error.
...do I even want to catch that error?
  - No. Lose top level ~condition-case~
    - k

#+begin_src elisp
(setq imp--timing-feature-current nil)
(pp-to-string (macroexpand-1 (imp-parser source/core/packages/imp/test/data/load/manual-test)))
#+end_src

#+begin_quote
Debugger entered--Lisp error: (wrong-type-argument stringp nil)
  file-name-absolute-p(nil)
#+end_quote

the new check is doin' it.
  - fixed

add a path
#+begin_src elisp
(setq imp--timing-feature-current nil)
(imp-parser source/core/packages/imp/test/data/load/manual-test
  :path .emacs)
#+end_src

#+begin_quote
Debugger entered--Lisp error: (error "[ERROR--]:
imp-parser-load: Cannot find a file to load.
path:’/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test’
 -> load-path:’nil’")
#+end_quote

That should be the path...?
file:/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/
file:/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test.el
yeah, that's the file.

So why is path-load nil?

#+begin_src elisp
(setq imp--timing-feature-current nil)
(pp-to-string
 (macroexpand-1
  '(imp-parser source/core/packages/imp/test/data/load/manual-test
    :path .emacs)))
#+end_src

#+RESULTS:
: (progn
:   (imp-timing 'source/core/packages/imp/test/data/load/manual-test
:       "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:       (imp--error 'imp-parser-load
:                   "Cannot find a file to load. path:'%s' -> load-path:'%s'"
:                   "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:                   nil))
:   nil)

hmm... sus.
#+begin_src elisp
    (message "path: %S" path)
    (message "load: %S "(imp-path-load-file path))

    ;; Convert path to a load path.
    (let (path-load (imp-path-load-file path))

      (message "path: %S" path)
      (message "path-load: %S " path-load)
      (message "load: %S " (imp-path-load-file path))
#+end_src

#+begin_quote
path: "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
load: "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test.el"
path: "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
path-load: nil
load: "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test.el"
#+end_quote

oh. Not enough parens.

#+begin_src elisp
(setq imp--timing-feature-current nil)
(pp-to-string
 (macroexpand-1
  '(imp-parser source/core/packages/imp/test/data/load/manual-test
    :path .emacs)))
#+end_src

#+RESULTS:
: (imp-timing 'source/core/packages/imp/test/data/load/manual-test
:     "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test.el"
:     (load
:      "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/imp/test/data/load/manual-test"
:      'nil 'nomessage))

k.

#+begin_src elisp
(setq imp--timing-feature-current nil)
(imp-parser source/core/packages/imp/test/data/load/manual-test
  :path user-emacs-directory)
#+end_src
  - works

Good enough for now.


** ├CURRENT┤ imp-parser keyword: ~:root~?
:LOGBOOK:
- State "├CURRENT┤"  from              [2025-10-16 Thu 21:55]
:END:

Allow adding a dir as a feature's root.

so this should add to ~imp-path-roots~:
#+begin_src elisp
(setq imp--timing-feature-current nil)
;; TODO: delete from root paths
(imp-parser imp:/test/data/load/does-not-exist
  :optional t
  :root 'itdl
)
#+end_src

expect ~(itdl "~/.config/emacs/source/core/packages/imp/test/data/load/" nil)~ in:
#+begin_src elisp
(pp-to-string imp-path-roots)
#+end_src

I need to do a thing after load.
  - which will probably mess up how load works, since it assumes it's last.
Add a secret keyword for "load happens here in the turn order"?

And I need the full real actual path so I can make the root.
  - So load will need to put that in the plist when its done?

Or I need to get the full real actual path during path handling.

move code in
  - [[file:source/core/packages/imp/parser.el::;; Figure out path from FEATURE?][imp-parser-load]]
to
  - [[file:source/core/packages/imp/parser.el::;; Add (some of) FEATURE to end of path?][imp-parser-normalize/:path]]

Make ~:path~ default to nil so we always run the path normalization.
Make ~:path~ handler also put load path into ~state~.

Add ~:root~ to the vars
  - [[file:source/core/packages/imp/parser.el::(defcustom imp-parser-keywords][imp-parser-keywords]]
    - Put a comment in there for where the loading should happen.
  - +[[file:source/core/packages/imp/parser.el::(defcustom imp-parser-defaults][imp-parser-defaults]]+
    - Don't wanna do anything if keyword doesn't exist, so don't have a default.

(imp-parser-normalize/:path :user/foo :path '(user-emacs-directory))

(imp-feature-normalize 'test)

#+begin_src elisp
(let ((name 'test/foo/bar)
      (keyword :root)
      (args '(t))
      ;;(args '(test))
      (rest nil)
      (state (list :path (imp-path-current-dir))))
  (imp-parser-normalize/:root name keyword args))
  (imp-parser-handler/:root name keyword (car args) rest state))
#+end_src

Hokay.

Add to ~imp-parser~ docstr
  - [[file:source/core/packages/imp/parser.el:::optional OPT Load NAME if it exists; do nothing if it does not.][here]]
kk

~:root~ as flag.
#+begin_src elisp
(imp-parser-only-one
 "hello"
 '("test");(imp-parser-normalize-flag :_ nil)
 #'imp-parser-normalize-symbol-or-string)
#+end_src

#+begin_src elisp
(let ((name 'test/foo/bar)
      (keyword :root)
      args
      ;;(args '(t))
      ;;(args '(test))
      (rest nil)
      (state (list :path (imp-path-current-dir))))
  (imp-parser-normalize/:root name keyword args))
#+end_src
  - k

TEST!

#+begin_src elisp
(pp-to-string imp-path-roots)
#+end_src

#+RESULTS:
#+begin_example
((imp "~/.config/emacs/source/core/packages/imp/" nil)
 (:theme
  "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/namespaced/theme"
  "init.el" nil)
 (:str
  "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/namespaced/str"
  "init.el" nil)
 (:datetime
  "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/namespaced/datetime"
  "init.el" nil)
 (:unit
  "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/namespaced/unit"
  "init.el" nil)
 (:buffer
  "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/namespaced/buffer"
  "init.el" nil)
 (:elisp
  "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/source/core/packages/namespaced/elisp"
  "init.el" nil)
 (:user "~/.config/emacs/source/user" nil nil)
 (:emacs.d "~/.config/emacs/" nil nil)
 (:imp "/home/main/.config/emacs/source/core/packages/imp" "init.el" nil))
#+end_example

#+begin_src elisp :results scalar
(macroexpand-1 '(imp-parser temp/init
                  :root
                  :path .emacs))
#+end_src

#+RESULTS:
: (progn (imp-path-root-set 'temp "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/temp") (imp-timing 'temp/init "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/temp/init" (load "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/temp/init" 'nil 'nomessage)))

yay?

#+begin_src elisp :results scalar
(list :result (imp-parser temp/init
              :root
              :path .emacs)
      :roots imp-path-roots)
#+end_src

ok.
butt.....
Need to allow dupes in `imp-path-root-set'.

Hm... why was the first set right but now it wants the parent of what it should have?
#+begin_quote
existing: "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/temp"
new:      "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005"
e == n ?  nil
#+end_quote

#+begin_src elisp
(pp-to-string
 (macroexpand-1
  '(imp-parser temp/init
     :root
     :path .emacs)))
#+end_src

#+RESULTS:
: (progn
:   (imp-path-root-set 'temp
:                      "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005")
:   (imp-timing 'temp:/init
:       "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/init"
:       (load "/home/main/ocean/vault/.config/emacs/2025-03-13_sn005/init" 'nil
:             'nomessage)))

Maybe because root exists, and roots don't add to their path....
So they should and get deduped?

╔════════╦════════════╦══════════════════════════════════════════════════════════════════════════════════════════════════════════╗
╠══TODO══╣            ║                                                                                                          ║
╠══TODO══╬══tomorrow══╣                                            ¡¡¡YOU ARE HERE!!!                                            ║
╠══TODO══╣            ║                                                                                                          ║
╚════════╩════════════╩══════════════════════════════════════════════════════════════════════════════════════════════════════════╝
Commit as is

debug with clean slate


hm... maybe get this working again?
#+begin_src elisp
(pp-to-string
 (macroexpand-1
  '(imp-parser imp:/test/data/load/does-not-exist
     :optional t)))
#+end_src

